/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "Valore non valido.";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = "Il valore “%@” non è valido.";

/* NSFormattingError */
"Err2048-C" = "Errore di formattazione.";

/* NSFileLockingError */
"Err255-C" = "Impossibile proteggere il documento.";

/* NSFileLockingError */
"Err255-R" = "Il documento potrebbe essere già protetto, oppure potresti non avere i privilegi di accesso adeguati per proteggerlo.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Impossibile proteggere il documento “%@”.";

/* NSFileReadUnknownError */
"Err256" = "Impossibile aprire il documento.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Impossibile aprire il documento “%@”.";

/* NSFileReadNoPermissionError */
"Err257" = "Non è stato possibile aprire il documento perché non hai i privilegi di accesso adeguati.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Non hai i privilegi di accesso adeguati.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Per visualizzare o modificare i privilegi di accesso, seleziona l'elemento nel Finder e scegli Archivio > Ottieni informazioni.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "Non è stato possibile aprire il documento “%@” perché non hai i privilegi di accesso adeguati.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Nome documento non valido.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Impossibile aprire l'elemento perchè il nome “%@” del documento non è valido.";

/* NSFileReadCorruptFileError */
"Err259" = "Impossibile aprire il documento perché non è nel formato corretto.";

/* NSFileReadCorruptFileError */
"Err259-C" = "Il documento non è nel formato corretto.";

/* NSFileReadCorruptFileError */
"Err259-R" = "Il documento potrebbe essere danneggiato, incompleto o in un formato diverso da quello previsto.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Impossibile aprire il documento “%@” perchè non è nel formato corretto.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "Il documento non esiste.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "Il documento “%@” non esiste.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Impossibile aprire il documento utilizzando la codifica di testo specificata.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "La codifica di testo specificata non può essere applicata.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "La codifica di testo %@ non può essere applicata.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Il documento potrebbe essere stato registrato usando una codifica di testo diversa, o potrebbe non essere un documento di testo.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Impossibile aprire il documento utilizzando la codifica di testo %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Impossibile aprire il documento “%2$@” utilizzando la codifica di testo %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Impossibile aprire il documento perché il tipo di URL specificato non è supportato.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "Il tipo di URL specificato non è supportato.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Impossibile aprire il documento “%1$@” perché il tipo di URL %2$@ non è supportato.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Impossibile aprire il documento perché il tipo di URL %@ non è supportato.";

/* NSFileReadTooLargeError */
"Err263" = "Impossibile aprire il documento perchè è troppo grande.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "Il documento è troppo grande.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Impossibile aprire il documento “%@” perchè è troppo grande.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Impossibile aprire il documento perchè la codifica del testo del contenuto non può essere determinata.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "Impossibile determinare la codifica di testo del contenuto.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "potrebbe essere possibile aprire il documento specificando esplicitamente una codifica di testo.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Impossibile aprire il documento “%@” perchè la codifica del testo del contenuto non può essere determinata.";

/* NSUserCancelledError */
"Err3072-C" = "L’operazione è stata annullata.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "Impossibile rimuovere “%@”.";

/* NSFileNoSuchFileError */
"Err4-C" = "Il documento non esiste.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "Il documento “%@” non esiste.";

/* NSFileWriteUnknownError */
"Err512" = "Impossibile registrare il documento.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "Impossibile copiare “%1$@” in “%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "Impossibile collegare “%1$@” a “%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "Impossibile spostare “%1$@” in “%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "Impossibile rimuovere “%@”.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Impossibile registrare il documento “%2$@” nella cartella “%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Impossibile registrare il documento “%@”.";

/* NSFileWriteNoPermissionError */
"Err513" = "Non è stato possibile registrare il documento perché non hai i privilegi di accesso adeguati.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "Impossibile copiare “%1$@” perchè non hai i privilegi necessari per “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "Impossibile collegare “%1$@” perchè non hai i privilegi necessari per “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "Impossibile spostare “%1$@” perchè non hai i privilegi necessari per “%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "Impossibile rimuovere “%@” perchè non hai i privilegi di accesso necessari.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Non hai i privilegi di accesso adeguati.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Per visualizzare o modificare i privilegi di accesso, seleziona l'elemento nel Finder e scegli Archivio > Ottieni informazioni.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Non hai i privilegi di accesso adeguati per registrare il documento “%2$@” nella cartella “%1$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Non hai i privilegi di accesso adeguati per registrare il documento “%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Non è stato possibile registrare il documento perché il nome del documento non è valido.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Impossibile rimuovere l'elemento perchè il nome documento “%@” è invalido.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Nome documento non valido.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Impossibile registrare l'elemento perchè il nome documento “%@” è invalido.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Impossibile registrare il documento con la codifica di testo specificata.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "La codifica di testo specificata non può essere applicata.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "La codifica di testo %@ non può essere applicata.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Se possibile, seleziona un'altra codifica di testo.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Impossibile registrare il documento utilizzando la codifica di testo %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Impossibile registrare il documento “%2$@” utilizzando la codifica di testo %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Impossibile registrare il documento perché il tipo di URL specificato non è supportato.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "Il tipo di URL specificato non è supportato.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Impossibile registrare il documento “%1$@” perché il tipo di URL %2$@ non è supportato.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Impossibile registrare il documento perché il tipo di URL %@ non è supportato.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Il documento non è stato registrato per mancanza di spazio sufficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "Impossibile copiare “%1$@” in “%2$@” perchè lo spazio libero è insufficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "Impossibile collegare “%1$@” a “%2$@” perchè lo spazio libero è insufficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "Impossibile spostare “%1$@” in “%2$@” perchè lo spazio libero è insufficiente.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Non c'è spazio sufficiente.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "Spazio esaurito sul volume “%@”.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Rimuovi alcuni documenti dal volume e riprova.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Non puoi registrare il documento “%@” per mancanza di spazio sufficiente.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Impossibile registrare il documento “%1$@” perché lo spazio sul volume “%2$@” è esaurito.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "Impossibile completare l'operazione. (%1$@ errore %2$ld.)";

